Ran Plan for project: `demo` dir: `.infra/terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role.IAM-role must be replaced
-/+ resource "aws_iam_role" "IAM-role" {
      ~ arn                   = "arn:aws:iam::347383665746:role/K8-ServiceAccount-IAMRole-Medplum" -> (known after apply)
      ~ create_date           = "2025-04-24T19:16:04Z" -> (known after apply)
      ~ id                    = "K8-ServiceAccount-IAMRole-Medplum" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::347383665746:policy/Demo-Medplum-Rds",
          - "arn:aws:iam::347383665746:policy/assume-msk-cluster-full",
          - "arn:aws:iam::347383665746:policy/medplum-s3",
        ] -> (known after apply)
      ~ name                  = "K8-ServiceAccount-IAMRole-Medplum" -> "K8s-ServiceAccount-IAMRole-Medplum" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROAVBYNOCRJHVSPFOHW6" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.attach_rds_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "attach_rds_policy" {
      ~ id         = "K8-ServiceAccount-IAMRole-Medplum-20250425202144951600000001" -> (known after apply)
      ~ role       = "K8-ServiceAccount-IAMRole-Medplum" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.attach_s3_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "attach_s3_policy" {
      ~ id         = "K8-ServiceAccount-IAMRole-Medplum-20250425172802875000000001" -> (known after apply)
      ~ role       = "K8-ServiceAccount-IAMRole-Medplum" -> "K8s-ServiceAccount-IAMRole-Medplum" # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "vault_identifier" but a
│ value was found in file "env/demo.tfvars". If you meant to use this value,
│ add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p demo
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.ffar0wwu.com/lock?id=ThirtyMadison%252Fmedplum%252F.infra%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p demo
  ```
Plan: 3 to add, 0 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```